In [1]:
import pandas as pd
import pandasql
import os

In [8]:
path = "/home/fatemeh/ED-Scale/outputs/bugbug/bugbug-1/results_exp_1_labels_63"
result_df = pd.read_pickle(os.path.join(path, "results_df.pickle"))
res_per_table = pd.read_pickle(os.path.join(path, "results_per_table.pickle"))
scores_all = pd.read_pickle(os.path.join(path, "scores_all.pickle"))
samples = pd.read_pickle(os.path.join(path, "sampled_tuples.pkl"))

In [9]:
df = pd.DataFrame.from_dict(res_per_table).T
df

,table_name,table_shape,tp,fp,fn,tn,precision,recall,f_score
4,rayyan,"(1000, 10)",0,0,151,9838,0,0.0,0
0,beers,"(2410, 10)",692,1717,127,21554,0.287256,0.844933,0.428748
3,movies_1,"(7390, 16)",0,0,2063,116162,0,0.0,0
2,hospital,"(1000, 20)",0,0,509,19473,0,0.0,0
1,flights,"(2376, 7)",2149,2601,457,11416,0.452421,0.824635,0.584285

In [10]:
scores_all

{'n_samples': 54,
 'total_recall': 0.46236384327751584,
 'total_precision': 0.39709578330075396,
 'total_fscore': 0.427251558626906,
 'total_tp': 2844,
 'total_fp': 4318,
 'total_tn': 178503,
 'total_fn': 3307}

In [ ]:
query = 'SELECT count(*) from result_df where predicted = 1 and label = 1'
pandasql.sqldf(query)

In [10]:
scores_all

{'n_samples': 63,
 'total_recall': 0.3064542350837262,
 'total_precision': 0.4580801944106926,
 'total_fscore': 0.36723163841807915,
 'total_tp': 1885,
 'total_fp': 2230,
 'total_tn': 180591,
 'total_fn': 4266}

In [22]:
1885 + 2230 + 180591 + 4266

188972

In [27]:
result_df[(result_df["predicted"] == 0) & (result_df["label"] == 0)]

,table_id,table_name,col_id,col_name,cell_idx,cell_value,predicted,label
0,3,movies_1,6,actors,0,"Anthony Perkins,Janet Leigh,Vera Miles",0,0
1,3,movies_1,6,actors,1,"Lori Cardille,Terry Alexander,Joseph Pilato",0,0
2,3,movies_1,6,actors,2,"Joel McCrea,Laraine Day,Herbert Marshall",0,0
3,3,movies_1,6,actors,3,"Dalton Trumbo,Joan Allen,Brian Dennehy",0,0
4,3,movies_1,6,actors,4,"Joe Nussbaum,Daryl Frazetti,Doug Jones",0,0
...,...,...,...,...,...,...,...,...
188967,4,rayyan,6,article_jvolumn,995,144.0,0,0
188968,4,rayyan,6,article_jvolumn,996,78.0,0,0
188969,4,rayyan,6,article_jvolumn,997,NaN,0,0
188970,4,rayyan,6,article_jvolumn,998,26.0,0,0
188971,4,rayyan,6,article_jvolumn,999,13.0,0,0

In [21]:
result_df.shape

(188972, 8)

In [4]:
res = pd.read_pickle("/home/fatemeh/ED-Scale/outputs/050223/eds/cluster-sizes/results_exp_1_labels_63/scores_col_cluster_('1.0', '0').pickle")

In [11]:
result_df

,table_id,table_name,col_id,col_name,cell_idx,cell_value,predicted,label
0,3,movies_1,6,actors,0,"Anthony Perkins,Janet Leigh,Vera Miles",0,0
1,3,movies_1,6,actors,1,"Lori Cardille,Terry Alexander,Joseph Pilato",0,0
2,3,movies_1,6,actors,2,"Joel McCrea,Laraine Day,Herbert Marshall",0,0
3,3,movies_1,6,actors,3,"Dalton Trumbo,Joan Allen,Brian Dennehy",0,0
4,3,movies_1,6,actors,4,"Joe Nussbaum,Daryl Frazetti,Doug Jones",0,0
...,...,...,...,...,...,...,...,...
188967,4,rayyan,6,article_jvolumn,995,144.0,0,0
188968,4,rayyan,6,article_jvolumn,996,78.0,0,0
188969,4,rayyan,6,article_jvolumn,997,NaN,0,0
188970,4,rayyan,6,article_jvolumn,998,26.0,0,0
188971,4,rayyan,6,article_jvolumn,999,13.0,0,0

In [27]:
col_df = pd.read_csv("/home/fatemeh/ED-Scale/Sandbox_Generation/one_dataset_exp/output/1feb/column_groups/col_df_labels_cluster_0.csv")

In [28]:
col_df

,Unnamed: 0,column_cluster_label,col_value,table_id,table_path,table_cluster,col_id
0,0,0,"['Albany', 'Albany', 'Albany', 'Albany', 'Alba...",0,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,0
1,1,1,"['Animal', 'Animal', 'Animal', 'Animal', 'Anim...",0,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,1
2,2,7,"['Amphibians', 'Amphibians', 'Amphibians', 'Am...",0,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,2
3,3,8,"['Frogs and Toads', 'Frogs and Toads', 'Frogs ...",0,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,3
4,4,4,"['Anaxyrus americanus', 'Anaxyrus fowleri', 'H...",0,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,4
...,...,...,...,...,...,...,...
499,499,6,"['Protected Bird - Game with open season', 'Th...",41,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,7
500,500,9,"['not listed', 'not listed', 'not listed', 'no...",41,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,8
501,501,10,"['S5B', 'S3B', '4', '3S4B,S3N', '4', 'S5', 'S4...",41,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,9
502,502,5,"['G5', 'G5', 'Gi5', '5G', '5', 'G5', 'G5', 'G5...",41,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,10
503,503,3,"['Recently Confirmed', 'Recently Confirmed', '...",41,/home/fatemeh/ED-Scale/Sandbox_Generation/one_...,0,11

In [30]:
import pickle
with open("/home/fatemeh/ED-Scale/Sandbox_Generation/one_dataset_exp/output/without_col_name/features.pkl", 'rb') as pickle_file:
    content = pickle.load(pickle_file)
    type(content)
samples = result_df[(result_df["label"]== -1) & (result_df["predicted"] == -1) & (result_df["table_name"] =="file_0")]
samples["sample_act_label"] = samples.apply(lambda row: content[(row["table_id"], row["col_id"], row["cell_idx"], "gt")], axis=1)

/tmp/ipykernel_2169707/3831890180.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  samples["sample_act_label"] = samples.apply(lambda row: content[(row["table_id"], row["col_id"], row["cell_idx"], "gt")], axis=1)

In [32]:
samples[samples["sample_act_label"] == 1]

,table_id,table_name,col_id,col_name,cell_idx,cell_value,predicted,label,sample_act_label
32284,0,file_0,2,taxonomic_group,284,Amphibians,-1,-1,1
40010,0,file_0,4,scientific_name,10,Anaxyrus fowleri,-1,-1,1
48022,0,file_0,3,taxonomic_subgroup,22,"Herons, Bitterns, Egrets, Pelicans",-1,-1,1
64234,0,file_0,1,category,234,Aimal,-1,-1,1
88223,0,file_0,5,common_name,223,Mallard,-1,-1,1

In [35]:
result_df[(result_df["label"] == 1) & (result_df["predicted"] == 0) & (result_df["col_name"] == "category")]

,table_id,table_name,col_id,col_name,cell_idx,cell_value,predicted,label
64236,0,file_0,1,category,236,Animlal,0,1
64490,0,file_0,1,category,490,qAnimal,0,1
64610,1,file_1,1,category,110,Aimal,0,1
64794,1,file_1,1,category,294,sAnimal,0,1
65082,2,file_10,1,category,82,Animaxl,0,1
...,...,...,...,...,...,...,...,...
71911,15,file_9,1,category,411,Animadl,0,1
71933,15,file_9,1,category,433,Aimal,0,1
71934,15,file_9,1,category,434,Animakl,0,1
71935,15,file_9,1,category,435,nimal,0,1
71948,15,file_9,1,category,448,iAnimal,0,1

In [ ]:
import json
k = json.load("{-1: (0.011844669898545655, 20009), 0: (0.9655172413793104, 29), 1: (0.8823529411764706, 17), 2: (0.9655172413793104, 29), 3: (0.9615384615384616, 26), 4: (0.8823529411764706, 17), 5: (0.9333333333333333, 15), 6: (0.9411764705882353, 17), 7: (0.9444444444444444, 18), 8: (0.9, 10), 9: (0.9375, 16), 10: (0.875, 16), 11: (0.9230769230769231, 13), 12: (0.9473684210526315, 19), 13: (0.7777777777777778, 9), 14: (0.9090909090909091, 11), 15: (0.9230769230769231, 13), 16: (0.8333333333333334, 6), 17: (0.8, 5), 18: (0.8888888888888888, 9), 19: (0.6666666666666666, 6), 20: (0.6, 5), 21: (0.9, 10), 22: (1.0, 14), 23: (0.9090909090909091, 11), 24: (0.8333333333333334, 12), 25: (0.875, 16), 26: (0.8333333333333334, 6), 27: (0.875, 16), 28: (0.8333333333333334, 12), 29: (1.0, 20), 30: (0.8823529411764706, 17), 31: (0.9166666666666666, 12), 32: (0.8888888888888888, 9), 33: (1.0, 10), 34: (0.8333333333333334, 6), 35: (0.8888888888888888, 9), 36: (0.7142857142857143, 7), 37: (1.0, 5)}")

In [2]:
d = pd.read_pickle("/home/fatemeh/ED-Scale/outputs/bugbug/bugbug/results_exp_1_labels_12/sampled_tuples.pkl")

In [3]:
d

[('1.0', 1, 2114),
 ('1.0', 1, 2380),
 ('1.0', 1, 4319),
 ('1.0', 1, 1438),
 ('1.0', 1, 6475),
 ('1.0', 0, 2251),
 ('1.0', 1, 2353),
 ('1.0', 0, 3705),
 ('1.0', 1, 1835),
 ('1.0', 0, 1817),
 ('1.0', 1, 1670),
 ('1.0', 1, 2025)]